hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/esb/nrf_esb.c
static void update_rf_payload_format_esb(uint32_t payload_length)
{
    NRF_RADIO->PCNF0 = (1 << RADIO_PCNF0_S0LEN_Pos) |
                       (0 << RADIO_PCNF0_LFLEN_Pos) |
                       (1 << RADIO_PCNF0_S1LEN_Pos);
                       
    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Disabled    << RADIO_PCNF1_WHITEEN_Pos) |
                       (RADIO_PCNF1_ENDIAN_Big          << RADIO_PCNF1_ENDIAN_Pos)  |
                       ((m_esb_addr.addr_length - 1)    << RADIO_PCNF1_BALEN_Pos)   |
                       (payload_length                  << RADIO_PCNF1_STATLEN_Pos) |
                       (payload_length                  << RADIO_PCNF1_MAXLEN_Pos);
}


static void update_radio_addresses(uint8_t update_mask)
{
    if((update_mask & NRF_ESB_ADDR_UPDATE_MASK_BASE0) != 0)
        NRF_RADIO->BASE0 = addr_conv(m_esb_addr.base_addr_p0);
        
    if((update_mask & NRF_ESB_ADDR_UPDATE_MASK_BASE1) != 0)
        NRF_RADIO->BASE1 = addr_conv(m_esb_addr.base_addr_p1);
        
    if((update_mask & NRF_ESB_ADDR_UPDATE_MASK_PREFIX) != 0)
    {
        NRF_RADIO->PREFIX0 = bytewise_bit_swap(&m_esb_addr.pipe_prefixes[0]);
        NRF_RADIO->PREFIX1 = bytewise_bit_swap(&m_esb_addr.pipe_prefixes[4]);
    }
}


static void update_radio_tx_power()
{
    NRF_RADIO->TXPOWER = m_config_local.tx_output_power << RADIO_TXPOWER_TXPOWER_Pos;
}


static bool update_radio_bitrate()
{
    NRF_RADIO->MODE = m_config_local.bitrate << RADIO_MODE_MODE_Pos;
    
    switch(m_config_local.bitrate)
    {
        case NRF_ESB_BITRATE_2MBPS:
            #ifdef NRF52_SERIES
        case NRF_ESB_BITRATE_2MBPS_BLE:
            #endif
            m_wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_2MBPS;
            break;
            
        case NRF_ESB_BITRATE_1MBPS:
            m_wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_1MBPS;
            break;
            
            #ifdef NRF51
            
        case NRF_ESB_BITRATE_250KBPS:
            m_wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_250KBPS;
            break;
            #endif
            
        case NRF_ESB_BITRATE_1MBPS_BLE:
            m_wait_for_ack_timeout_us = RX_WAIT_FOR_ACK_TIMEOUT_US_1MBPS_BLE;
            break;
            
        default:
            // Should not be reached
            return false;
    }
    
    return true;
}


static bool update_radio_protocol()
{
    switch(m_config_local.protocol)
    {
        case NRF_ESB_PROTOCOL_ESB_DPL:
            update_rf_payload_format = update_rf_payload_format_esb_dpl;
            break;
            
        case NRF_ESB_PROTOCOL_ESB:
            update_rf_payload_format = update_rf_payload_format_esb;
            break;
            
        default:
            // Should not be reached
            return false;
    }
    
    return true;
}


static bool update_radio_crc()
{
    switch(m_config_local.crc)
    {
        case NRF_ESB_CRC_16BIT:
            NRF_RADIO->CRCINIT = 0xFFFFUL;      // Initial value
            NRF_RADIO->CRCPOLY = 0x11021UL;     // CRC poly: x^16+x^12^x^5+1
            break;
            
        case NRF_ESB_CRC_8BIT:
            NRF_RADIO->CRCINIT = 0xFFUL;        // Initial value
            NRF_RADIO->CRCPOLY = 0x107UL;       // CRC poly: x^8+x^2^x^1+1
            break;
            
        case NRF_ESB_CRC_OFF:
            break;
            
        default:
            return false;
    }
    
    NRF_RADIO->CRCCNF = m_config_local.crc << RADIO_CRCCNF_LEN_Pos;
    return true;
}


static bool update_radio_parameters()
{
    bool params_valid = true;
    update_radio_tx_power();
    params_valid &= update_radio_bitrate();
    params_valid &= update_radio_protocol();
    params_valid &= update_radio_crc();
    update_rf_payload_format(m_config_local.payload_length);
    params_valid &= (m_config_local.retransmit_delay >= NRF_ESB_RETRANSMIT_DELAY_MIN);
    return params_valid;
}


static void reset_fifos()
{
    m_tx_fifo.entry_point = 0;
    m_tx_fifo.exit_point  = 0;
    m_tx_fifo.count       = 0;
    
    m_rx_fifo.entry_point = 0;
    m_rx_fifo.exit_point  = 0;
    m_rx_fifo.count       = 0;
}


static void initialize_fifos()
{
    reset_fifos();
    
    for(int i = 0; i < NRF_ESB_TX_FIFO_SIZE; i++)
        m_tx_fifo.p_payload[i] = &m_tx_fifo_payload[i];
        
    for(int i = 0; i < NRF_ESB_RX_FIFO_SIZE; i++)
        m_rx_fifo.p_payload[i] = &m_rx_fifo_payload[i];
}


uint32_t nrf_esb_skip_tx()
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    VERIFY_TRUE(m_tx_fifo.count > 0, NRF_ERROR_BUFFER_EMPTY);
    
    DISABLE_RF_IRQ();
    
    m_tx_fifo.count--;
    
    if(++m_tx_fifo.exit_point >= NRF_ESB_TX_FIFO_SIZE)
        m_tx_fifo.exit_point = 0;
        
    ENABLE_RF_IRQ();
    
    return NRF_SUCCESS;
}

/** @brief  Function to push the content of the rx_buffer to the RX FIFO.

    The module will point the register NRF_RADIO->PACKETPTR to a buffer for receiving packets.
    After receiving a packet the module will call this function to copy the received data to
    the RX FIFO.

    @param  pipe Pipe number to set for the packet.
    @param  pid  Packet ID.

    @retval true   Operation successful.
    @retval false  Operation failed.
*/
static bool rx_fifo_push_rfbuf(uint8_t pipe, uint8_t pid)
{
    if(m_rx_fifo.count < NRF_ESB_RX_FIFO_SIZE)
    {
        if(m_config_local.protocol == NRF_ESB_PROTOCOL_ESB_DPL)
        {
            if(m_rx_payload_buffer[0] > NRF_ESB_MAX_PAYLOAD_LENGTH)
                return false;
                
            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = m_rx_payload_buffer[0];
        }
        
        else if(m_config_local.mode == NRF_ESB_MODE_PTX)
        {
            // Received packet is an acknowledgment
            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = 0;
        }
        
        else
            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = m_config_local.payload_length;
            
        memcpy(m_rx_fifo.p_payload[m_rx_fifo.entry_point]->data, &m_rx_payload_buffer[2],
               m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length);
               
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->pipe  = pipe;
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->rssi  = NRF_RADIO->RSSISAMPLE;
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->pid   = pid;
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->noack = !(m_rx_payload_buffer[1] & 0x01);
        
        if(++m_rx_fifo.entry_point >= NRF_ESB_RX_FIFO_SIZE)
            m_rx_fifo.entry_point = 0;
            
