hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/esb/nrf_esb.c
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->SHORTS = m_radio_shorts_common | RADIO_SHORTS_DISABLED_TXEN_Msk;
    
    NRF_RADIO->TASKS_RXEN = 1;
}

static void on_radio_disabled_rx(void)
{
    bool            ack                = false;
    bool            retransmit_payload = false;
    bool            send_rx_event      = true;
    pipe_info_t    *p_pipe_info;
    
    if(NRF_RADIO->CRCSTATUS == 0)
    {
        clear_events_restart_rx();
        return;
    }
    
    if(m_rx_fifo.count >= NRF_ESB_RX_FIFO_SIZE)
    {
        clear_events_restart_rx();
        return;
    }
    
    p_pipe_info = &m_rx_pipe_info[NRF_RADIO->RXMATCH];
    
    if(NRF_RADIO->RXCRC             == p_pipe_info->crc &&
       (m_rx_payload_buffer[1] >> 1) == p_pipe_info->pid
      )
    {
        retransmit_payload = true;
        send_rx_event = false;
    }
    
    p_pipe_info->pid = m_rx_payload_buffer[1] >> 1;
    p_pipe_info->crc = NRF_RADIO->RXCRC;
    
    if((m_config_local.selective_auto_ack == false) || ((m_rx_payload_buffer[1] & 0x01) == 1))
        ack = true;
        
    if(ack)
    {
        NRF_RADIO->SHORTS = m_radio_shorts_common | RADIO_SHORTS_DISABLED_RXEN_Msk;
        
        switch(m_config_local.protocol)
        {
            case NRF_ESB_PROTOCOL_ESB_DPL:
            {
                if(m_tx_fifo.count > 0 &&
                   (m_tx_fifo.p_payload[m_tx_fifo.exit_point]->pipe == NRF_RADIO->RXMATCH)
                  )
                {
                    // Pipe stays in ACK with payload until TX FIFO is empty
                    // Do not report TX success on first ack payload or retransmit
                    if(p_pipe_info->ack_payload == true && !retransmit_payload)
                    {
                        if(++m_tx_fifo.exit_point >= NRF_ESB_TX_FIFO_SIZE)
                            m_tx_fifo.exit_point = 0;
                            
                        m_tx_fifo.count--;
                        
                        // ACK payloads also require TX_DS
                        // (page 40 of the 'nRF24LE1_Product_Specification_rev1_6.pdf').
                        m_interrupt_flags |= NRF_ESB_INT_TX_SUCCESS_MSK;
                    }
                    
                    p_pipe_info->ack_payload = true;
                    
                    mp_current_payload = m_tx_fifo.p_payload[m_tx_fifo.exit_point];
                    
                    update_rf_payload_format(mp_current_payload->length);
                    m_tx_payload_buffer[0] = mp_current_payload->length;
                    memcpy(&m_tx_payload_buffer[2],
                           mp_current_payload->data,
                           mp_current_payload->length);
                }
                
                else
                {
                    p_pipe_info->ack_payload = false;
                    update_rf_payload_format(0);
                    m_tx_payload_buffer[0] = 0;
                }
                
                m_tx_payload_buffer[1] = m_rx_payload_buffer[1];
            }
            break;
            
            case NRF_ESB_PROTOCOL_ESB:
            {
                update_rf_payload_format(0);
                m_tx_payload_buffer[0] = m_rx_payload_buffer[0];
                m_tx_payload_buffer[1] = 0;
            }
            break;
        }
        
        m_nrf_esb_mainstate = NRF_ESB_STATE_PRX_SEND_ACK;
        NRF_RADIO->TXADDRESS = NRF_RADIO->RXMATCH;
        NRF_RADIO->PACKETPTR = (uint32_t)m_tx_payload_buffer;
        on_radio_disabled = on_radio_disabled_rx_ack;
    }
    
    else
        clear_events_restart_rx();
        
    if(send_rx_event)
    {
        // Push the new packet to the RX buffer and trigger a received event if the operation was
        // successful.
        if(rx_fifo_push_rfbuf(NRF_RADIO->RXMATCH, p_pipe_info->pid))
        {
            m_interrupt_flags |= NRF_ESB_INT_RX_DATA_RECEIVED_MSK;
            NVIC_SetPendingIRQ(ESB_EVT_IRQ);
        }
    }
}


static void on_radio_disabled_rx_ack(void)
{
    NRF_RADIO->SHORTS = m_radio_shorts_common | RADIO_SHORTS_DISABLED_TXEN_Msk;
    update_rf_payload_format(m_config_local.payload_length);
    
    NRF_RADIO->PACKETPTR = (uint32_t)m_rx_payload_buffer;
    on_radio_disabled = on_radio_disabled_rx;
    
    m_nrf_esb_mainstate = NRF_ESB_STATE_PRX;
}


/** @brief Function for clearing pending interrupts.

    @param[in,out]   p_interrupts        Pointer to the value that holds the current interrupts.

    @retval  NRF_SUCCESS                     If the interrupts were cleared successfully.
    @retval  NRF_ERROR_NULL                  If the required parameter was NULL.
    @retval  NRF_INVALID_STATE               If the module is not initialized.
*/
static uint32_t nrf_esb_get_clear_interrupts(uint32_t *p_interrupts)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    VERIFY_PARAM_NOT_NULL(p_interrupts);
    
    DISABLE_RF_IRQ();
    
    *p_interrupts = m_interrupt_flags;
    m_interrupt_flags = 0;
    
    ENABLE_RF_IRQ();
    
    return NRF_SUCCESS;
}


void RADIO_IRQHandler()
{
    if(NRF_RADIO->EVENTS_READY && (NRF_RADIO->INTENSET & RADIO_INTENSET_READY_Msk))
    {
        NRF_RADIO->EVENTS_READY = 0;
        DEBUG_PIN_SET(DEBUGPIN1);
    }
    
    if(NRF_RADIO->EVENTS_END && (NRF_RADIO->INTENSET & RADIO_INTENSET_END_Msk))
    {
        NRF_RADIO->EVENTS_END = 0;
        DEBUG_PIN_SET(DEBUGPIN2);
        
        // Call the correct on_radio_end function, depending on the current protocol state
        if(on_radio_end)
            on_radio_end();
    }
    
    if(NRF_RADIO->EVENTS_DISABLED && (NRF_RADIO->INTENSET & RADIO_INTENSET_DISABLED_Msk))
    {
        NRF_RADIO->EVENTS_DISABLED = 0;
        DEBUG_PIN_SET(DEBUGPIN3);
        
        // Call the correct on_radio_disable function, depending on the current protocol state
        if(on_radio_disabled)
            on_radio_disabled();
    }
    
    DEBUG_PIN_CLR(DEBUGPIN1);
    DEBUG_PIN_CLR(DEBUGPIN2);
    DEBUG_PIN_CLR(DEBUGPIN3);
    DEBUG_PIN_CLR(DEBUGPIN4);
}


uint32_t nrf_esb_init(nrf_esb_config_t const *p_config)
{
    uint32_t err_code;
    
    VERIFY_PARAM_NOT_NULL(p_config);
    
