hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/esb/nrf_esb.c
    NRF_RADIO->SHORTS      = m_radio_shorts_common | RADIO_SHORTS_DISABLED_TXEN_Msk;
    NRF_RADIO->INTENSET    = RADIO_INTENSET_DISABLED_Msk;
    m_nrf_esb_mainstate    = NRF_ESB_STATE_PRX;
    
    NRF_RADIO->RXADDRESSES  = m_esb_addr.rx_pipes_enabled;
    NRF_RADIO->FREQUENCY    = m_esb_addr.rf_channel;
    NRF_RADIO->PACKETPTR    = (uint32_t)m_rx_payload_buffer;
    
    NVIC_ClearPendingIRQ(RADIO_IRQn);
    NVIC_EnableIRQ(RADIO_IRQn);
    
    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_PAYLOAD = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    
    NRF_RADIO->TASKS_RXEN  = 1;
    
    return NRF_SUCCESS;
}


uint32_t nrf_esb_stop_rx(void)
{
    if(m_nrf_esb_mainstate == NRF_ESB_STATE_PRX)
    {
        NRF_RADIO->SHORTS = 0;
        NRF_RADIO->INTENCLR = 0xFFFFFFFF;
        on_radio_disabled = NULL;
        NRF_RADIO->EVENTS_DISABLED = 0;
        NRF_RADIO->TASKS_DISABLE = 1;
        
        while(NRF_RADIO->EVENTS_DISABLED == 0);
        
        m_nrf_esb_mainstate = NRF_ESB_STATE_IDLE;
        
        return NRF_SUCCESS;
    }
    
    return NRF_ESB_ERROR_NOT_IN_RX_MODE;
}


uint32_t nrf_esb_flush_tx(void)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    
    DISABLE_RF_IRQ();
    
    m_tx_fifo.count = 0;
    m_tx_fifo.entry_point = 0;
    m_tx_fifo.exit_point = 0;
    
    ENABLE_RF_IRQ();
    
    return NRF_SUCCESS;
}


uint32_t nrf_esb_pop_tx(void)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    VERIFY_TRUE(m_tx_fifo.count > 0, NRF_ERROR_BUFFER_EMPTY);
    
    DISABLE_RF_IRQ();
    
    if(--m_tx_fifo.entry_point >= NRF_ESB_TX_FIFO_SIZE)
        m_tx_fifo.entry_point = 0;
        
    m_tx_fifo.count--;
    
    ENABLE_RF_IRQ();
    
    return NRF_SUCCESS;
}


uint32_t nrf_esb_flush_rx(void)
{
    VERIFY_TRUE(m_esb_initialized, NRF_ERROR_INVALID_STATE);
    
    DISABLE_RF_IRQ();
    
    m_rx_fifo.count = 0;
    m_rx_fifo.entry_point = 0;
    m_rx_fifo.exit_point = 0;
    
    memset(m_rx_pipe_info, 0, sizeof(m_rx_pipe_info));
    
    ENABLE_RF_IRQ();
    
    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_address_length(uint8_t length)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(length > 2 && length < 6, NRF_ERROR_INVALID_PARAM);
    
    #ifdef NRF52832_XXAA
    uint32_t base_address_mask = length == 5 ? 0xFFFF0000 : 0xFF000000;
    
    if((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004200)   //Check if the device is an nRF52832 Rev. 1.
    {
        /*
            Workaround for nRF52832 Rev 1 Errata 107
            Check if pipe 0 or pipe 1-7 has a 'zero address'.
            Avoid using access addresses in the following pattern (where X is don't care):
            ADDRLEN=5
            BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00
            BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX
            BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX
            BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX
            BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00
            BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX
            BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX
            BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX
        
            ADDRLEN=4
            BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00
            BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX
            BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX
            BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX
            BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00
            BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX
            BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX
            BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
        */
        if((NRF_RADIO->BASE0 & base_address_mask) == 0 && (NRF_RADIO->PREFIX0 & 0x000000FF) == 0)
            return NRF_ERROR_INVALID_PARAM;
            
        if((NRF_RADIO->BASE1 & base_address_mask) == 0 && ((NRF_RADIO->PREFIX0 & 0x0000FF00) == 0 || (NRF_RADIO->PREFIX0 & 0x00FF0000) == 0 || (NRF_RADIO->PREFIX0 & 0xFF000000) == 0 ||
                                                           (NRF_RADIO->PREFIX1 & 0xFF000000) == 0 || (NRF_RADIO->PREFIX1 & 0x00FF0000) == 0 || (NRF_RADIO->PREFIX1 & 0x0000FF00) == 0 || (NRF_RADIO->PREFIX1 & 0x000000FF) == 0))
            return NRF_ERROR_INVALID_PARAM;
    }
    
    #endif
    
    m_esb_addr.addr_length = length;
    
    update_rf_payload_format(m_config_local.payload_length);
    
    #ifdef NRF52832_XXAA
    
    if((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004500)   //Check if the device is an nRF52832 Rev. 2.
        return apply_address_workarounds();
        
    else
        return NRF_SUCCESS;
        
    #else
    return NRF_SUCCESS;
    #endif
}


uint32_t nrf_esb_set_base_address_0(uint8_t const *p_addr)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_PARAM_NOT_NULL(p_addr);
    
    #ifdef NRF52832_XXAA
    
    if((NRF_FICR->INFO.VARIANT & 0x0000FF00) == 0x00004200)   //Check if the device is an nRF52832 Rev. 1.
    {
        /*
            Workaround for nRF52832 Rev 1 Errata 107
            Check if pipe 0 or pipe 1-7 has a 'zero address'.
            Avoid using access addresses in the following pattern (where X is don't care):
            ADDRLEN=5
            BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00
            BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX
            BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX
            BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX
            BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00
            BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX
            BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX
            BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX
        
            ADDRLEN=4
            BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00
            BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX
            BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX
            BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX
            BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00
            BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX
            BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX
            BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
        */
        uint32_t base_address_mask = m_esb_addr.addr_length == 5 ? 0xFFFF0000 : 0xFF000000;
        
        if((addr_conv(p_addr) & base_address_mask) == 0 && (NRF_RADIO->PREFIX0 & 0x000000FF) == 0)
            return NRF_ERROR_INVALID_PARAM;
    }
    
    #endif
    
    
    
    memcpy(m_esb_addr.base_addr_p0, p_addr, 4);
    
